In [1]:
%ls

 Volume in drive C is Windows
 Volume Serial Number is 5CBD-F8F3

 Directory of C:\Users\Tommy\Documents\Jupyter Notebooks\CPE 365

12/08/2016  04:05 PM    <DIR>          .
12/08/2016  04:05 PM    <DIR>          ..
12/08/2016  04:04 PM    <DIR>          .ipynb_checkpoints
12/07/2016  05:46 PM    <DIR>          data
12/08/2016  04:04 PM                72 Untitled.ipynb
               1 File(s)             72 bytes
               4 Dir(s)  448,966,406,144 bytes free

In [7]:
%ls data

 Volume in drive C is Windows
 Volume Serial Number is 5CBD-F8F3

 Directory of C:\Users\Tommy\Documents\Jupyter Notebooks\CPE 365\data

12/08/2016  04:07 PM    <DIR>          .
12/08/2016  04:07 PM    <DIR>          ..
12/07/2016  05:43 PM        11,130,825 attainment.csv
12/07/2016  05:43 PM            19,750 expenditure.csv
12/07/2016  05:43 PM            32,241 school_and_country_table.csv
12/07/2016  05:43 PM           268,231 timesData.csv
               4 File(s)     11,451,047 bytes
               2 Dir(s)  448,969,515,008 bytes free

In [1]:
import pandas as pd

In [14]:
?pd.read_csv

In [167]:
data = pd.read_csv('data/expenditure_orig.csv', engine='python')

In [49]:
data.head()

,country,institute_type,direct_expenditure_type,1995,2000,2005,2009,2010,2011
0,OECD Average,All Institutions,Public,4.9,4.9,5.0,5.4,5.4,5.3
1,Australia,All Institutions,Public,4.5,4.6,4.3,4.5,4.6,4.3
2,Austria,All Institutions,Public,5.3,5.4,5.2,5.7,5.6,5.5
3,Belgium,All Institutions,Public,5.0,5.1,5.8,6.4,6.4,6.4
4,Canada,All Institutions,Public,5.8,5.2,4.8,5.0,5.2,NaN

In [50]:
data['institute_type'].unique()

array(['All Institutions ', 'Elementary and Secondary Institutions ',
       'Higher Education Institutions '], dtype=object)

In [51]:
data['direct_expenditure_type'].unique()

array(['Public', 'Private', 'Total'], dtype=object)

In [168]:
data = data[data['institute_type']=='Higher Education Institutions ']
data = data[data['country']!='OECD Average']

In [178]:
for i in data.index:
    data.loc[i, 'country'] = str(data.loc[i, 'country']).strip()

In [169]:
data = data[['country', 'direct_expenditure_type', '2011']]

In [170]:
data=data.rename(columns = {'direct_expenditure_type':'type', '2011' : 'expenditure'})

In [180]:
data.to_csv('data/expenditure.csv', index=False)

In [5]:
%ls data

 Volume in drive C is Windows
 Volume Serial Number is 5CBD-F8F3

 Directory of C:\Users\Tommy\Documents\Jupyter Notebooks\CPE 365\data

12/08/2016  04:27 PM    <DIR>          .
12/08/2016  04:27 PM    <DIR>          ..
12/07/2016  05:43 PM        11,130,825 attainment_orig.csv
12/08/2016  04:26 PM             3,752 expenditure.csv
12/07/2016  05:43 PM            19,750 expenditure_orig.csv
12/07/2016  05:43 PM            32,241 school_and_country_table.csv
12/07/2016  05:43 PM           268,231 timesData.csv
               5 File(s)     11,454,799 bytes
               2 Dir(s)  448,935,952,384 bytes free

In [145]:
data = pd.read_csv('data/attainment_orig.csv', engine='python')

In [7]:
data.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [17]:
data['series_name'].unique()

array([ "UIS: Percentage of population age 25+ with at least a completed bachelor's or equivalent degree (ISCED 6 or higher). Gender Parity Index"], dtype=object)

We want the following:
       "UIS: Percentage of population age 25+ with a completed bachelor's or equivalent degree (ISCED 6). Female",
       "UIS: Percentage of population age 25+ with a completed bachelor's or equivalent degree (ISCED 6). Male",
       "UIS: Percentage of population age 25+ with a completed bachelor's or equivalent degree (ISCED 6). Total",
       "UIS: Percentage of population age 25+ with a completed master's or equivalent degree (ISCED 7). Female",
       "UIS: Percentage of population age 25+ with a completed master's or equivalent degree (ISCED 7). Male",
       "UIS: Percentage of population age 25+ with a completed master's or equivalent degree (ISCED 7). Total",
       'UIS: Percentage of population age 25+ with a doctoral degree or equivalent (ISCED 8). Female',
       'UIS: Percentage of population age 25+ with a doctoral degree or equivalent (ISCED 8). Male',
       'UIS: Percentage of population age 25+ with a doctoral degree or equivalent (ISCED 8). Total'

In [38]:
cond = [data['series_name'][i]  in ["UIS: Percentage of population age 25+ with a completed bachelor's or equivalent degree (ISCED 6). Female",
       "UIS: Percentage of population age 25+ with a completed bachelor's or equivalent degree (ISCED 6). Male",
       "UIS: Percentage of population age 25+ with a completed bachelor's or equivalent degree (ISCED 6). Total",
       "UIS: Percentage of population age 25+ with a completed master's or equivalent degree (ISCED 7). Female",
       "UIS: Percentage of population age 25+ with a completed master's or equivalent degree (ISCED 7). Male",
       "UIS: Percentage of population age 25+ with a completed master's or equivalent degree (ISCED 7). Total",
       "UIS: Percentage of population age 25+ with a doctoral degree or equivalent (ISCED 8). Female",
       "UIS: Percentage of population age 25+ with a doctoral degree or equivalent (ISCED 8). Male",
       "UIS: Percentage of population age 25+ with a doctoral degree or equivalent (ISCED 8). Total"] for i in range(len(data))]

In [146]:
data = data[cond][['country_name', 'series_name', '2013']]

In [82]:
?pd.Series

In [147]:
data['gender'] = pd.Series(index=data.index, dtype='object')
data['degree'] = pd.Series(index=data.index, dtype='object')

In [148]:
replace(data)

In [112]:

def replace (data):
    for i in data.index:
        if 'Female' in data.loc[i, 'series_name']:
            data.loc[i, 'gender'] = 'female'
        elif 'Male' in data.loc[i, 'series_name']:
            data.loc[i, 'gender'] = 'male'
        elif 'Total' in data.loc[i, 'series_name']:
            data.loc[i, 'gender'] = 'total'
            
        if 'bachelor' in data.loc[i, 'series_name']:
            data.loc[i, 'degree'] = 'bachelor'
        elif 'master' in data.loc[i, 'series_name']:
            data.loc[i, 'degree'] = 'master'
        elif 'doctoral' in data.loc[i, 'series_name']:
            data.loc[i, 'degree'] = 'doctoral'
    #data['category'] = ['bachelor' if data['series_name'][i].contains('bachelor') else 'master' if data['series_name'][i].contains('master')
     #                else 'doctoral' if data['series_name'][i].contains('doctoral') for i in range(len(data))]

In [143]:
data['2013'].count()

219

In [155]:
data = data.dropna()

In [154]:
data.dropna()['country_name'].unique()

array(['Australia', 'Azerbaijan', 'Belgium', 'Bulgaria', 'Colombia',
       'Cyprus', 'Czech Republic', 'Dominican Republic', 'Ecuador',
       'Estonia', 'Guatemala', 'Hungary', 'Kuwait', 'Latvia', 'Lithuania',
       'Luxembourg', 'Malta', 'Mexico', 'Moldova', 'Netherlands', 'Poland',
       'Qatar', 'Romania', 'Saudi Arabia', 'Serbia', 'Singapore',
       'Slovak Republic', 'St. Lucia', 'Sweden', 'Turkey', 'Uganda',
       'United Kingdom', 'United States', 'Uruguay', 'West Bank and Gaza'], dtype=object)

In [157]:
data = data[data.columns.drop('series_name')]

In [161]:
data = data.rename(columns = {'2013' : 'attainment', 'country_name' : 'country'})

In [166]:
data.to_csv('data/attainment.csv', index=False)

In [165]:
?pd.DataFrame.to_csv()

In [2]:
att = pd.read_csv('data/attainment.csv', engine='python')
exp = pd.read_csv('data/expenditure.csv', engine='python')
uni = pd.read_csv('data/school_and_country_table.csv', engine='python')
rank = pd.read_csv('data/timesData.csv', engine='python')

In [190]:
exp = pd.read_csv('data/expenditure.csv', engine='python')

In [2]:
%ls data

 Volume in drive C is Windows
 Volume Serial Number is 5CBD-F8F3

 Directory of C:\Users\Tommy\Documents\GitHub\CPE365-Project\data

12/09/2016  01:43 AM    <DIR>          .
12/09/2016  01:43 AM    <DIR>          ..
12/09/2016  01:09 AM             7,928 attainment.csv
12/07/2016  05:43 PM        11,130,825 attainment_orig.csv
12/09/2016  01:22 AM             2,155 expenditure.csv
12/07/2016  05:43 PM            19,750 expenditure_orig.csv
12/09/2016  01:25 AM            32,241 school_and_country_table.csv
12/07/2016  05:43 PM           268,231 timesData.csv
               6 File(s)     11,461,130 bytes
               2 Dir(s)  445,472,878,592 bytes free

In [10]:
att.head()

     country  attainment  gender    degree
0  Australia    23.36578  female  bachelor
1  Australia    18.56723    male  bachelor
2  Australia    20.98663   total  bachelor
3  Australia     4.80526  female    master
4  Australia     4.73661    male    master

In [3]:
exp.head()

     country    type  expenditure
0  Australia  Public          0.7
1    Austria  Public          1.4
2    Belgium  Public          1.3
3     Canada  Public          NaN
4      Chile  Public          0.7

In [4]:
uni.head()

                             school_name                   country
0                     Harvard University  United States of America
1     California Institute of Technology  United States of America
2  Massachusetts Institute of Technology  United States of America
3                    Stanford University  United States of America
4                   Princeton University  United States of America

In [14]:
rank.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011

In [106]:
uni.columns

Index(['school_name', 'country'], dtype='object')

In [108]:
match = [rank.loc[i, 'cname'] in list(country['cname']) for i in rank.index]
#match2 = ["University of Hawa" in rank['university_name'][i] for i in rank.index]

In [110]:
sum(match)/len(match)

1.0

In [40]:
rank.loc[2205,'country'] = 'United Kingdom'

In [48]:
countries = uni['country'].unique()

In [73]:
type(countries)

numpy.ndarray

In [61]:
import numpy as np

In [82]:
helper = np.arange(1, len(countries)+1)

In [83]:

country = pd.DataFrame(data = [countries, helper])

In [97]:
country.columns = ['cname', 'id']

In [100]:
country.head()

        cname id
0   Argentina  1
1   Australia  2
2     Austria  3
3  Bangladesh  4
4     Belarus  5

In [140]:
country.to_csv('data/country.csv', index=False)

In [92]:
rank = rank.rename(columns = {'university_name' : 'university', 'world_rank' : 'rank', 'total_score' : 'score', 'country' : 'cname', 'student_staff_ratio' : 'SFRatio', 'female_male_ratio' : 'FMRatio','num_students' : 'nStudents', 'international_students' : 'nInternational'})

In [122]:
rank = rank.rename(columns = {'id' : 'country'})

In [124]:
rank = rank[rank.columns.drop('cname')]

In [125]:
rank.head()

,rank,university,teaching,international,research,citations,income,score,nStudents,SFRatio,nInternational,FMRatio,year,country
0,1,Harvard University,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011,70
1,2,California Institute of Technology,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011,70
2,3,Massachusetts Institute of Technology,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011,70
3,4,Stanford University,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011,70
4,5,Princeton University,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011,70

In [135]:
uni = uni.merge(country, on='cname').rename(columns = {'id' : 'country', 'school_name' : 'name'})[['name', 'country']]

In [137]:
uni['id'] = uni.index+1

In [139]:
uni.to_csv('data/university.csv', index=False)

In [142]:
rank = rank.merge(uni.rename(columns = {'name' : 'university'}), on='university')

In [145]:
rank = rank[rank.columns.drop('university', 'country_y')].rename(columns = {'country_x' : 'country', 'id' : 'university'})

In [148]:
rank = rank[rank.columns.drop('country_y')]

In [149]:
rank.head()

,rank,teaching,international,research,citations,income,score,nStudents,SFRatio,nInternational,FMRatio,year,country,university
0,1,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011,70,1
1,2,95.8,67.5,97.4,99.8,35.9,93.9,"20,152",8.9,25%,NaN,2012,70,1
2,4,94.9,63.7,98.6,99.2,39.9,93.6,"20,152",8.9,25%,NaN,2013,70,1
3,2,95.3,66.2,98.5,99.1,40.6,93.9,"20,152",8.9,25%,NaN,2014,70,1
4,2,92.9,67.6,98.6,98.9,44.0,93.3,"20,152",8.9,25%,NaN,2015,70,1

In [156]:
rank.nStudents = [str(rank.nStudents.loc[i]).replace(',', '') for i in rank.nStudents.index]

In [160]:
rank.head()

,rank,teaching,international,research,citations,income,score,nStudents,SFRatio,nInternational,FMRatio,year,country,university
0,1,99.7,72.4,98.7,98.8,34.5,96.1,20152,8.9,25%,NaN,2011,70,1
1,2,95.8,67.5,97.4,99.8,35.9,93.9,20152,8.9,25%,NaN,2012,70,1
2,4,94.9,63.7,98.6,99.2,39.9,93.6,20152,8.9,25%,NaN,2013,70,1
3,2,95.3,66.2,98.5,99.1,40.6,93.9,20152,8.9,25%,NaN,2014,70,1
4,2,92.9,67.6,98.6,98.9,44.0,93.3,20152,8.9,25%,NaN,2015,70,1

In [161]:
rank.to_csv('data/rank.csv', index=False)

In [175]:
exp['country'][exp['country']=='Slovak Republic'] = 'Slovakia'

C:\Users\Tommy\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

In [192]:
exp = exp.rename(columns=({'country' : 'cname'})).merge(country, on='cname')

In [182]:
sum([exp.country.unique()[i] in country.cname.unique() for i in range(len(exp.country.unique()))])

35

In [195]:
exp = exp[exp.columns.drop('cname')].rename(columns = {'id' : 'country'})

In [207]:
exp = exp.dropna()

In [203]:
?pd.DataFrame.count()

In [177]:
country.cname.unique()

array(['Argentina', 'Australia', 'Austria', 'Bangladesh', 'Belarus',
       'Belgium', 'Brazil', 'Canada', 'Chile', 'China', 'Colombia',
       'Cyprus', 'Czech Republic', 'Denmark', 'Egypt', 'Estonia',
       'Finland', 'France', 'Germany', 'Ghana', 'Greece', 'Hong Kong',
       'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Israel',
       'Italy', 'Japan', 'Jordan', 'Kenya', 'Latvia', 'Lebanon',
       'Lithuania', 'Luxembourg', 'Macau', 'Malaysia', 'Mexico', 'Morocco',
       'Netherlands', 'New Zealand', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Poland', 'Portugal', 'Qatar', 'Republic of Ireland',
       'Romania', 'Russian Federation', 'Saudi Arabia', 'Serbia',
       'Singapore', 'Slovakia', 'Slovenia', 'South Africa', 'South Korea',
       'Spain', 'Sweden', 'Switzerland', 'Taiwan', 'Thailand', 'Turkey',
       'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom',
       'United States of America'], dtype=object)

In [208]:
exp.to_csv('data/expense.csv', index=False)

In [211]:
att.country.unique()

array(['Australia', 'Azerbaijan', 'Belgium', 'Bulgaria', 'Colombia',
       'Cyprus', 'Czech Republic', 'Dominican Republic', 'Ecuador',
       'Estonia', 'Guatemala', 'Hungary', 'Kuwait', 'Latvia', 'Lithuania',
       'Luxembourg', 'Malta', 'Mexico', 'Moldova', 'Netherlands', 'Poland',
       'Qatar', 'Romania', 'Saudi Arabia', 'Serbia', 'Singapore',
       'Slovak Republic', 'St. Lucia', 'Sweden', 'Turkey', 'Uganda',
       'United Kingdom', 'United States', 'Uruguay', 'West Bank and Gaza'], dtype=object)

In [237]:
sum([att.country.unique()[i] in country.cname.unique() for i in range(len(exp.country.unique()))])

20

In [231]:
att = pd.read_csv('data/attainment.csv', engine='python')

In [235]:
att.loc[att['country'] == 'Slovak Republic','country'] = 'Slovakia'

In [236]:
att.country.unique()

array(['Australia', 'Azerbaijan', 'Belgium', 'Bulgaria', 'Colombia',
       'Cyprus', 'Czech Republic', 'Dominican Republic', 'Ecuador',
       'Estonia', 'Guatemala', 'Hungary', 'Kuwait', 'Latvia', 'Lithuania',
       'Luxembourg', 'Malta', 'Mexico', 'Moldova', 'Netherlands', 'Poland',
       'Qatar', 'Romania', 'Saudi Arabia', 'Serbia', 'Singapore',
       'Slovakia', 'St. Lucia', 'Sweden', 'Turkey', 'Uganda',
       'United Kingdom', 'United States America', 'Uruguay',
       'West Bank and Gaza'], dtype=object)

In [216]:
country.cname.unique()

array(['Argentina', 'Australia', 'Austria', 'Bangladesh', 'Belarus',
       'Belgium', 'Brazil', 'Canada', 'Chile', 'China', 'Colombia',
       'Cyprus', 'Czech Republic', 'Denmark', 'Egypt', 'Estonia',
       'Finland', 'France', 'Germany', 'Ghana', 'Greece', 'Hong Kong',
       'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Israel',
       'Italy', 'Japan', 'Jordan', 'Kenya', 'Latvia', 'Lebanon',
       'Lithuania', 'Luxembourg', 'Macau', 'Malaysia', 'Mexico', 'Morocco',
       'Netherlands', 'New Zealand', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Poland', 'Portugal', 'Qatar', 'Republic of Ireland',
       'Romania', 'Russian Federation', 'Saudi Arabia', 'Serbia',
       'Singapore', 'Slovakia', 'Slovenia', 'South Africa', 'South Korea',
       'Spain', 'Sweden', 'Switzerland', 'Taiwan', 'Thailand', 'Turkey',
       'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom',
       'United States of America'], dtype=object)

In [238]:
att = att.rename(columns=({'country' : 'cname'})).merge(country, on='cname')

In [239]:
att = att[att.columns.drop('cname')]

In [240]:
att = att.dropna()

In [242]:
att['attainment'] /= 100

In [245]:
att = att.rename(columns={'id' : 'country'})

In [246]:
att.to_csv('attainment_.csv', index=False)